app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("created_at", "description", "manufacturer", "name", "registered_at", "stock", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = 1  [["name", "gfuyuuyuy"], ["updated_at", "2014-03-04 15:22:00.742887"]]